In [2]:
import pandas as pd
import zipfile
import os
import io
os.getcwd()

'/Users/domenicospoto/Desktop/Sapienza/MScDataScience/FundamentalsofDataScienceandLaboratory/FinalProject'

In [3]:
zip_df = zipfile.ZipFile('walmart-recruiting-store-sales-forecasting.zip')
zip_df.extractall()
zip_df.close()

In [4]:
train = pd.read_csv('train.csv.zip', compression='zip')
test = pd.read_csv('test.csv.zip', compression='zip')
features = pd.read_csv('features.csv.zip', compression='zip')
stores = pd.read_csv('stores.csv')
sample_submission = pd.read_csv('sampleSubmission.csv.zip', compression='zip')

In [41]:
stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [10]:
features.tail()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
8185,45,2013-06-28,76.05,3.639,4842.29,975.03,3.00,2449.97,3169.69,NaN,NaN,False
8186,45,2013-07-05,77.50,3.614,9090.48,2268.58,582.74,5797.47,1514.93,NaN,NaN,False
8187,45,2013-07-12,79.37,3.614,3789.94,1827.31,85.72,744.84,2150.36,NaN,NaN,False
8188,45,2013-07-19,82.84,3.737,2961.49,1047.07,204.19,363.00,1059.46,NaN,NaN,False
8189,45,2013-07-26,76.06,3.804,212.02,851.73,2.06,10.88,1864.57,NaN,NaN,False

In [11]:
test.tail()

        Store  Dept        Date  IsHoliday
115059     45    98  2013-06-28      False
115060     45    98  2013-07-05      False
115061     45    98  2013-07-12      False
115062     45    98  2013-07-19      False
115063     45    98  2013-07-26      False

In [13]:
train.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  2010-02-05      24924.50      False
1      1     1  2010-02-12      46039.49       True
2      1     1  2010-02-19      41595.55      False
3      1     1  2010-02-26      19403.54      False
4      1     1  2010-03-05      21827.90      False

In [12]:
train.tail()

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98  2012-09-28        508.37      False
421566     45    98  2012-10-05        628.10      False
421567     45    98  2012-10-12       1061.02      False
421568     45    98  2012-10-19        760.01      False
421569     45    98  2012-10-26       1076.80      False

In [5]:
print(train.shape)
print(test.shape)
print(features.shape)
print(stores.shape)
print(sample_submission.shape)

(421570, 5)
(115064, 4)
(8190, 12)
(45, 3)
(115064, 2)

In [8]:
features['MarkDown1']

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
         ...
8185    4842.29
8186    9090.48
8187    3789.94
8188    2961.49
8189     212.02
Name: MarkDown1, Length: 8190, dtype: float64

In [16]:
sample_submission

                      Id  Weekly_Sales
0         1_1_2012-11-02             0
1         1_1_2012-11-09             0
2         1_1_2012-11-16             0
3         1_1_2012-11-23             0
4         1_1_2012-11-30             0
...                  ...           ...
115059  45_98_2013-06-28             0
115060  45_98_2013-07-05             0
115061  45_98_2013-07-12             0
115062  45_98_2013-07-19             0
115063  45_98_2013-07-26             0

[115064 rows x 2 columns]